# 클래스, 객체
# 객체 : Object <- 모든 클래스의 슈퍼 클래스 (파이썬, 자바, 자바스크립트,...)
# 모든 클래스, 내가 만드는 클래스의 기원은 Object 이다

# 객체의 개념 -> 이 세상에 존재하는 모든 사물(유형), 생각(무형)
# -> 프로그램에서 구현하고자 한다 -> 도구 -> 형상화 할 수 있는 -> 문법적으로
# -> class -> 객체의 청사진이다

# class의 인스턴스(instance)가 객체다 -> 메모리에 임시로 생기는 것
#---------------------------------------------------------------------------------
# 객체 -> 속성과 행동이라는 두가지 특성이 있음
# 속성 : 특성 -> 사람의 속성 특징 : 눈, 코, 입, 귀, 팔 2개, 다리 2개
#       class 구성원 : 멤버 변수
# 행동 : 액션 -> 메소드/함수 -> 밥을 먹는다, 잠을 잔다, 걷는다, 말한다
#       class 구성원 : 멤버 함수

# 객체 지향 프로그램 (OOP) : Object Orient... Program